// / ============================= \
// | -------  esthete014  -------- |
// | ============================= |
// |     || copyright 2022 ||      |
// |     || Nikolay        ||      |
// |     || Kochetov       ||      |
// | _____________________________ |
// | https://github.com/esthete014 |
// \ ============================= /


/// FILE FOR USERS
/// just write phrases to use it in menu
#pragma once
#include <iostream>
#include <vector>

std::string title1 = "  Задание №1 | \"Применение шаблонного вектора.\" ";
/// <summary>
/// vector of phrases for first task \n
/// https://github.com/UsovaMA/Informatics-and-Programming/blob/master/Materials/STL.pdf
/// </summary>
/// <returns>
/// " Объявить вектор целых чисел на 20 элементов, заполненный сразу нулями.",
/// " Заполнить вектор случайно (от -100 до 100), параллельно выводя его на экран (использовать итератор).",
/// " Вывести максимальный и минимальный элементы.",
/// " Отсортировать вектор.",
/// " Добавить 4 любых элемента в конец вектора.",
/// " Заменить элементы меньшие 10 на ноль.",
/// " Найти и вывести элементы больше 20.",
/// " Все чётные элементы домножить на 3.",
/// " Произвольно перемешать элементы.",
/// " Удалить элементы большие 50.",
/// " Вывести количество элементов в векторе. Если количество нечётное - удалить последний элемент, иначе напечатать элементы в обратном порядке",
/// " Очистить вектор."
/// </returns>
std::vector<std::string> phrase1source = {
		" Объявить вектор целых чисел на 20 элементов, заполненный сразу нулями.",
		" Заполнить вектор случайно (от -100 до 100), параллельно выводя его на экран (использовать итератор).",
		" Вывести максимальный и минимальный элементы.",
		" Отсортировать вектор.",
		" Добавить 4 любых элемента в конец вектора.",
		" Заменить элементы меньшие 10 на ноль.",
		" Найти и вывести элементы больше 20.",
		" Все чётные элементы домножить на 3.",
		" Произвольно перемешать элементы.",
		" Удалить элементы большие 50.",
		" Вывести количество элементов в векторе. Если количество нечётное - удалить последний элемент, иначе напечатать элементы в обратном порядке",
		" Очистить вектор."
};


std::string title2 = "  Задание №2 | \"Применение шаблонного списка.\" ";
/// <summary>
/// vector of phrases for second task \n
/// https://github.com/UsovaMA/Informatics-and-Programming/blob/master/Materials/STL.pdf
/// </summary>
/// <returns>
/// " Объявить список. Изначально он будет пустой.",
/// " Добавить 5 элементов в конец списка.",
/// " Вывести на экран элемент из начала списка.",
/// " Добавить в начало списка 2 элемента.",
/// " Удалить 4-й элемент.",
/// " Вставить на 3 случайные позиции случайный элемент (одинаковый).",
/// " Удалить последний элемент списка.",
/// " Удалить элемент из начала списка.",
/// " Вставить 2 элемента в середину списка (2 сразу).",
/// " Удалить повторяющиеся элементы списка.",
/// " Очистить список.",
/// " Проверить, что список пуст. Вывести сообщение, если он пуст."
/// </returns>
std::vector<std::string> phrase2source = {
	" Объявить список. Изначально он будет пустой.",
	" Добавить 5 элементов в конец списка.",
	" Вывести на экран элемент из начала списка.",
	" Добавить в начало списка 2 элемента.",
	" Удалить 4-й элемент.",
	" Вставить на 3 случайные позиции случайный элемент (одинаковый).",
	" Удалить последний элемент списка.",
	" Удалить элемент из начала списка.",
	" Вставить 2 элемента в середину списка (2 сразу).",
	" Удалить повторяющиеся элементы списка.",
	" Очистить список.",
	" Проверить, что список пуст. Вывести сообщение, если он пуст."
};


std::string title3 = "  Задание №3 | \"Применение стека.\" ";
/// <summary>
/// vector of phrases for third task \n
/// https://github.com/UsovaMA/Informatics-and-Programming/blob/master/Materials/STL.pdf
/// </summary>
/// <returns>
/// " положить элемент(пользователь задаёт элемент)",
/// " забрать элемент(пишется сообщение «Элемент % был удалён из стека.»)",
/// " напечатать содержимое стека в виде",
/// " очистить стек"
/// </returns>
std::vector<std::string> phrase3source = {
	" положить элемент(пользователь задаёт элемент)",
	" забрать элемент(пишется сообщение «Элемент % был удалён из стека.»)",
	" напечатать содержимое стека в виде",
	" очистить стек"
};


std::string title4 = "  Задание №4 | \"Применение множества.\" ";
/// <summary>
/// vector of phrases for fourth task \n
/// https://github.com/UsovaMA/Informatics-and-Programming/blob/master/Materials/STL.pdf
/// </summary>
/// <returns>
/// " Задать множества MainSetA и MainSetB.",
/// " Найти пересечения заданных множеств.",
/// " Найти объединение заданных множеств.",
/// " Найти разность множеств А-B.",
/// " Найти дополнение множества."
/// </returns>
std::vector<std::string> phrase4source = {
	" Задать множества MainSetA и MainSetB.",
	" Найти пересечения заданных множеств.",
	" Найти объединение заданных множеств.",
	" Найти разность множеств А-B.",
	" Найти дополнение множества."
};
